cf_billing/DataProcessors/бестЗагрузитьДанныеИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестЗагрузитьДанныеИзВнешнихИсточников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/бестДоговорыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДоговорыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестЗагруженныеДанныеИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестЗагруженныеДанныеИзВнешнихИсточников</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредоставленныеОбъемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Час</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗагруженныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГотовКОбработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьКоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчетаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗонаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШкалаИзФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГотовКОбработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/DataProcessors/бестЗагрузитьДанныеИзВнешнихИсточников/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Услуга 		= Константы.бестУслугаДляЗагрузкиПочасовыхВедомостей.Получить();
	Дата 		= НачалоМесяца(ТекущаяДатаСеанса()); 
	Организация = Справочники.Организации.НашаОрганизация;
	
	Если Параметры.Свойство("Договор") Тогда
		Договор = Параметры.Договор;
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Контрагент");
		Параметры.Свойство("Организация", Организация);
		Параметры.Свойство("Район", Район);
		Параметры.Свойство("ТочкаУчета", ТочкаУчета);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Контрагент = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Контрагент");
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Папка = ДиалогВыбораФайла.Каталог;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПутьКФайлу = бестПользовательскийВводКлиент.РаботаСДиалогомВыбора(РежимДиалогаВыбораФайла.Открытие,"Выберите файл","xls файл (*.xls)|*.xls",Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Дата3ПриИзменении(Элемент)
	Дата = НачалоМесяца(Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 	= Ложь;
	ФормаВыбора 			= ПолучитьФорму("Справочник.энргТочкиУчета.ФормаВыбора",,Элемент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаВыбора.Список,"Ссылка", ПолучитьМассивДоступныхТУ(), ВидСравненияКомпоновкиДанных.ВСписке);
	ФормаВыбора.Открыть();
КонецПроцедуры

#КонецОбласти

#Если НЕ МобильныйКлиент Тогда

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	СозданныеДокументы.Очистить();
	НезагруженныеДанные = ПредопределенноеЗначение("Документ.бестЗагруженныеДанныеИзВнешнихИсточников.ПустаяСсылка");
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаПУВеб", ЭтотОбъект);
		НачатьПомещениеФайла(ОписаниеОповещения, , , ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент(), УникальныйИдентификатор);
	Иначе
		МассивФайлов = ПолучитьФайлыДляЗагрузкиИзКаталога(Папка,"Загружен_");
		ExcelApp = Новый COMОбъект("Excel.Application");
		Для каждого Файл из МассивФайлов Цикл
			Попытка
				Книга = ExcelApp.Workbooks.Open(Файл.ПолноеИмя);
			Исключение
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось открыть файл. Возможно, он открыт в другом приложении.'"));
				Возврат;
			КонецПопытки; 	
			Попытка
				Страница = Книга.Worksheets(1);
			Исключение
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка: Не удалось найти лист в файле.'"));
				ExcelApp.Quit();
				Возврат;
			КонецПопытки;
			
			ПрочитатьЛистExcel(Страница);
			ExcelApp.Quit();
			Если ЗагрузитьДанныеПочасовойВедомости(Файл.ПолноеИмя) Тогда
				УстановитьПрефиксЗагруженногоФайла(Файл);
			КонецЕсли;
			ТЗПредоставленныеОбъемы.Очистить();
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьШаблонПоказаний(Команда)
	Результат = Новый Структура("Дата, Организация, Район, Услуга, Договор, ПодписантКонтрагента");
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	ИмяМакета  			= "ШаблонПоказаний";
	ТаблицаМакета 		= "Обработка.бестЗагрузитьДанныеИзВнешнихИсточников";
	
	МассивОбъектов = Договор;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТаблицаМакета,ИмяМакета,МассивОбъектов,ЭтотОбъект,Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоказания(Команда)
	СозданныеДокументыПоказаний.Очистить();
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаПУВеб", ЭтотОбъект);
		НачатьПомещениеФайла(ОписаниеОповещения, , , ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент(), УникальныйИдентификатор);
	Иначе
		МассивФайлов = ПолучитьФайлыДляЗагрузкиИзКаталога(Папка,"Загружен_");
		ExcelApp = Новый COMОбъект("Excel.Application");
		Для каждого Файл из МассивФайлов Цикл
			Попытка
				Книга = ExcelApp.Workbooks.Open(Файл.ПолноеИмя);
			Исключение
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось открыть файл. Возможно, он открыт в другом приложении.'"));
				Возврат;
			КонецПопытки; 	
			Попытка
				Страница = Книга.Worksheets(1);
			Исключение
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка: Не удалось найти лист в файле.'"));
				ExcelApp.Quit();
				Возврат;
			КонецПопытки;
			
			ПрочитатьЛистExcelПоказания(Страница);
			ExcelApp.Quit();
			ЗагрузитьДанныеПоказаний(Файл.ПолноеИмя);
			УстановитьПрефиксЗагруженногоФайла(Файл);
			ТЗПоказания.Очистить();
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда) 
	СозданныеДокументыПоказаний.Очистить();  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьФайлЗавершениеЗагрузкаИзExcel", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Интерактивно = Ложь;
	
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения,
		ПараметрыЗагрузки, ПутьКФайлу);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьГП(Команда)
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаПУВеб", ЭтотОбъект);
		НачатьПомещениеФайла(ОписаниеОповещения, , , ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент(), УникальныйИдентификатор);
	Иначе
		ExcelApp = Новый COMОбъект("Excel.Application");
		
		Попытка
			Книга = ExcelApp.Workbooks.Open(ПутьКФайлу);
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось открыть файл. Возможно, он открыт в другом приложении.'"));
			Возврат;
		КонецПопытки; 	
		Попытка
			Страница = Книга.Worksheets(1);
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Загрузка: Не удалось найти лист в файле.'"));
			ExcelApp.Quit();
			Возврат;
		КонецПопытки;
		
		ПрочитатьЛистExcelГП(Страница);
		ExcelApp.Quit();
		ЗагрузитьДанныеГП();
		ТЗПредоставленныеОбъемы.Очистить();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьШаблонПочасовогоПотребления(Команда)
	Результат = Новый Структура("Дата, Организация, Район, ТочкаУчета, Договор, ПодписантКонтрагента, ВидОперации");
	ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
	
	ИмяМакета  			= "ШаблонПочасовогоПотребления";
	ТаблицаМакета 		= "Обработка.бестЗагрузитьДанныеИзВнешнихИсточников";
	
	МассивОбъектов = Договор;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТаблицаМакета,ИмяМакета,МассивОбъектов,ЭтотОбъект,Результат);
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область СлужебныеПроцедурыИФункции 

#Область События_РаботаСФайлом 

&НаКлиенте
Процедура ПрочитатьЛистExcel(ЛистЭксель) 
	НомерПервойКолонки 	= 2;
	НомерПервойСтроки 	= 16;
	ВсегоСтрок 			= День(КонецМесяца(?(ЗначениеЗаполнено(ДатаФактическогоСобытия),ДатаФактическогоСобытия,Дата))) + НомерПервойСтроки - 1;
	ВсегоКолонок 		= 25;
	
	Для Строка = НомерПервойСтроки По ВсегоСтрок Цикл
		День = Дата(СокрЛП(ЛистЭксель.Cells(Строка,1).Text) + " 00:00:00");
		Для Колонка = НомерПервойКолонки По ВсегоКолонок Цикл
			НоваяСтрока = ТЗПредоставленныеОбъемы.Добавить();
			НоваяСтрока.День = День;
			Если ЗначениеЗаполнено(ЛистЭксель.Cells(Строка,Колонка).Text) Тогда
				НоваяСтрока.Объем = Число(СтрЗаменить(СокрЛП(ЛистЭксель.Cells(Строка,Колонка).Text)," ",""));
			Иначе
				НоваяСтрока.Объем = -1;
			КонецЕсли;
			НоваяСтрока.Час = Колонка - 2;	      				
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаводскойНомер 	= СокрЛП(ЛистЭксель.Cells(6, 16).Text);
	КодТУ 			= СокрЛП(ЛистЭксель.Cells(4, 23).Text);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФайлыДляЗагрузкиИзКаталога(КаталогПоиска, ПрефиксЗагруженногоФайла, Маска = "*.xlsx") 
	Ответ = Новый Массив;
	
	НайденныеФайлы = НайтиФайлы(КаталогПоиска, Маска);
	Для Каждого ТекФайл Из НайденныеФайлы Цикл
		Если СтрНайти(ТекФайл.ИмяБезРасширения, ПрефиксЗагруженногоФайла) > 0 Тогда
			Продолжить;	
		КонецЕсли; 
		
		Ответ.Добавить(ТекФайл);
	КонецЦикла; 	
	
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область ЗагрузкаПочасовыхВедомостей 

&НаСервере
Функция ЗагрузитьДанныеПочасовойВедомости(Файл) 
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("Дата", НачалоМесяца(Дата));   
	ПараметрыДокумента.Вставить("ФайлДляЧтения", Файл);
	ПараметрыДокумента.Вставить("ВидОперации", ВидОперации);
	ПараметрыДокумента.Вставить("ДатаФактическогоСобытия", ДатаФактическогоСобытия);
	ПараметрыДокумента.Вставить("УчитыватьКоэффициентПУ", УчитыватьКоэффициентПУ);
	
	НовыйДок = бестИнтеграции.ЗагрузитьДанныеПочасовойВедомости(ПараметрыДокумента, ЗаводскойНомер, КодТУ, ТЗПредоставленныеОбъемы.Выгрузить());
	Если НовыйДок <> Неопределено Тогда
		СозданныеДокументы.Добавить(НовыйДок);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Функция ПолучитьИмяФайлаПослеЗагрузки(ПолныйПуть)
	Результат	= ПолныйПуть;
	
	Файл 		= Новый Файл(ПолныйПуть);	
	Если НЕ Файл.Существует() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Результат			= СтрЗаменить(ПолныйПуть, "\" + ИмяБезРасширения, "\" + "Загружен_" + ИмяБезРасширения);
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция УстановитьПрефиксЗагруженногоФайла(ТекФайл)
	НовоеИмяФайла = ПолучитьИмяФайлаПослеЗагрузки(ТекФайл.ПолноеИмя);
	ПереместитьФайл(ТекФайл.ПолноеИмя, НовоеИмяФайла);
	
	Возврат НовоеИмяФайла;
КонецФункции

&НаСервере
Функция  ПолучитьМассивДоступныхТУ()
	Результат = РегистрыСведений.бестДоговорыТочекУчета.ПолучитьДанныеДоговоров(Организация,Район,Дата,Договор,,,Услуга);
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("ТочкаУчета");
КонецФункции

#КонецОбласти

#Область ЗагрузкаПоказаний 

&НаСервере
Процедура ЗагрузитьДанныеПоказаний(Файл)
	НовыйДок = Обработки.бестЗагрузитьДанныеИзВнешнихИсточников.ЗагрузитьДанныеПочасовойВедомости(Дата, Организация, Район, Услуга, Файл, ТЗПоказания.Выгрузить());
	СозданныеДокументыПоказаний.Добавить(НовыйДок);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcelПоказания(ЛистЭксель) 
	НомерПервойСтроки 	= 16;
	ВсегоСтрок			= ЛистЭксель.Cells.SpecialCells(11).Row;	
	Для Строка = НомерПервойСтроки По ВсегоСтрок Цикл
		Если НЕ ЗначениеЗаполнено(ЛистЭксель.Cells(Строка,2).Text) Тогда
			Прервать;
		КонецЕсли;
		НовСтр = ТЗПоказания.Добавить();
		НовСтр.ОбъектРасчетаКод 	= СокрЛП(ЛистЭксель.Cells(Строка,2).Text);
		НовСтр.ОбъектРасчетаИзФайла = СокрЛП(ЛистЭксель.Cells(Строка,3).Text) + "(" + СокрЛП(ЛистЭксель.Cells(Строка,2).Text) + ")";
		
		НовСтр.ТочкаУчетаИзФайла 	= СокрЛП(ЛистЭксель.Cells(Строка,6).Text);
		
		НовСтр.ПриборУчетаИзФайла 	= СокрЛП(ЛистЭксель.Cells(Строка,7).Text);
		
		НовСтр.ТарифнаяЗонаКод 		= СокрЛП(ЛистЭксель.Cells(Строка,11).Text);
		НовСтр.ТарифнаяЗонаИзФайла 	= СокрЛП(ЛистЭксель.Cells(Строка,10).Text) + "(" + СокрЛП(ЛистЭксель.Cells(Строка,11).Text) + ")";
		
		НовСтр.ШкалаКод 			= СокрЛП(ЛистЭксель.Cells(Строка,9).Text);
		НовСтр.ШкалаИзФайла 		= СокрЛП(ЛистЭксель.Cells(Строка,8).Text) + "(" + СокрЛП(ЛистЭксель.Cells(Строка,9).Text) + ")";
		Показание 					= СтрЗаменить(СокрЛП(ЛистЭксель.Cells(Строка,13).Text)," ","");
		Если ЗначениеЗаполнено(Показание) Тогда
			НовСтр.Показания = Число(Показание);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаПоказанийИзExcel  

&НаКлиенте
Процедура ОбработатьФайлЗавершениеЗагрузкаИзExcel(ПомещенныйФайл, ДополнительныеПараметры) Экспорт

   ЗагрузитьИзExcelНаСервере(ПомещенныйФайл.Хранение);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзExcelНаСервере(АдресВХ)
	
	ТаблицаДанных 		= ДесериализоватьФайл(АдресВХ);
		
	НовыйДок = Обработки.бестЗагрузитьДанныеИзВнешнихИсточников.ЗагрузитьДанныеПоказанийПирамидыЧерезExcel(Дата, Организация, ПутьКФайлу, ТаблицаДанных);
	СозданныеДокументыПоказаний.Добавить(НовыйДок);
	
 	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена");
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлДанных(ФайлДанных, ТаблицаДанных)
	
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.Прочитать(ФайлДанных);
	ПЗ 						= Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных 		= Новый ОписаниеИсточникаДанных(ТабДок.Область(2,1,ТабДок.ВысотаТаблицы+1,6));
	
	ПЗ.ДобавлениеПредставлений 	= ТипДобавленияПредставлений.НеДобавлять;
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();
	ТЗ = ПЗ.Результат.Выгрузить();
		
	Для Каждого ТекСтрока Из ТЗ Цикл
		
		Если Не ЗначениеЗаполнено(Формат(ТекСтрока[1], "ЧГ=0")) Тогда
			Продолжить;
		КонецЕсли;
		
		НСтрока = ТаблицаДанных.Добавить();
		НСтрока.IDСтроки		= "" + Новый УникальныйИдентификатор;
		НСтрока.ЗаводскойНомер 	= Формат(ТекСтрока[1], "ЧГ=0");
		НСтрока.ДатаПоказаний 	= СтроковыеФункцииКлиентСервер.СтрокаВДату(СокрЛП(ТекСтрока[2]));
		НСтрока.Адрес		 	= СокрЛП(ТекСтрока[3]);
		НСтрока.ТипУстройства 	= СокрЛП(ТекСтрока[4]);
		НСтрока.Показания	 	= Формат(ТекСтрока[5], "ЧГ=0");
			
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ДесериализоватьФайл(АдресВХ)
	ДвоичныеДанные 	= ПолучитьИзВременногоХранилища(АдресВХ); 	
	тПуть 			= ПолучитьИмяВременногоФайла("xls"); 
	ДвоичныеДанные.Записать(тПуть);	
	
	ТаблицаДанных 	= НоваяТаблицаДесериализированныхДанных();
	Попытка
		ПрочитатьФайлДанных(тПуть, ТаблицаДанных);	
	Исключение
		ТаблицаДанных.Очистить();
		
		ИнфоОбОшибки 	= ИнформацияОбОшибке();
		Комментарий 	= "Ошибка чтения файла по причине: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибки);
		пКомментарий 	= "Ошибка чтения файла по причине: " + Символы.ПС + КраткоеПредставлениеОшибки(ИнфоОбОшибки);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(пКомментарий);
		ЗаписьЖурналаРегистрации(
		"Загрузка показаний Пирамида", 
		УровеньЖурналаРегистрации.Ошибка,,,
		Комментарий);
	КонецПопытки;	
	
	Попытка
		УдалитьФайлы(тПуть);	
	Исключение
		ИнфоОбОшибки = ИнформацияОбОшибке();
		Комментарий = "Ошибка удаления временного файла. Путь к временному файлу: " + тПуть + Символы.ПС + ПодробноеПредставлениеОшибки(ИнфоОбОшибки);
		
		ЗаписьЖурналаРегистрации(
		"Загрузка показаний Пирамида", 
		УровеньЖурналаРегистрации.Ошибка,,,
		Комментарий);
	КонецПопытки; 	
	
	Возврат ТаблицаДанных;	 	
КонецФункции

Функция НоваяТаблицаДесериализированныхДанных()
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("IDСтроки"			, ОбщегоНазначения.ОписаниеТипаСтрока(36));
	Таблица.Колонки.Добавить("ТарифнаяЗона"		, Новый ОписаниеТипов("СправочникСсылка.энргТарифныеЗоны"));
	Таблица.Колонки.Добавить("ЗаводскойНомер"	, ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("Адрес"			, ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	Таблица.Колонки.Добавить("ТипУстройства"	, ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("Показания"		, ОбщегоНазначения.ОписаниеТипаЧисло(15, 6));
	Таблица.Колонки.Добавить("ДатаПоказаний"	, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Таблица.Колонки.Добавить("СтрокаЗаписана"	, Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
КонецФункции
#КонецОбласти

#Область ЗагрузкаГП

&НаКлиенте
Процедура ПрочитатьЛистExcelГП(ЛистЭксель) 
	НомерПервойКолонки 	= 2;
	НомерПервойСтроки 	= 6;
	ВсегоСтрок 			= 29;
	ВсегоКолонок 		= 15;
	Час = 0;
	Для Строка = НомерПервойСтроки По ВсегоСтрок Цикл
		Для Колонка = НомерПервойКолонки По ВсегоКолонок Цикл
			НоваяСтрока = ТЗПредоставленныеОбъемы.Добавить();
			НоваяСтрока.День = Дата(СокрЛП(ЛистЭксель.Cells(5,Колонка).Text) + " 00:00:00");
			НоваяСтрока.Объем = Число(СтрЗаменить(СокрЛП(ЛистЭксель.Cells(Строка,Колонка).Text)," ",""));
			НоваяСтрока.Час = Час;	
		КонецЦикла;
		Час = Час + 1;
	КонецЦикла;
	
	НомерПервойКолонки 	= 2;
	НомерПервойСтроки 	= 33;
	ВсегоСтрок 			= 56;
	ВсегоКолонок 		= День(КонецМесяца(Дата)) - 14;
	Час = 0;
	Для Строка = НомерПервойСтроки По ВсегоСтрок Цикл
		Для Колонка = НомерПервойКолонки По ВсегоКолонок Цикл
			НоваяСтрока = ТЗПредоставленныеОбъемы.Добавить();
			НоваяСтрока.День = Дата(СокрЛП(ЛистЭксель.Cells(32,Колонка).Text) + " 00:00:00");
			НоваяСтрока.Объем = Число(СтрЗаменить(СокрЛП(ЛистЭксель.Cells(Строка,Колонка).Text)," ",""));
			НоваяСтрока.Час = Час;	  	
		КонецЦикла;
		Час = Час + 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеГП()
	СозданныйПрофильГП = Обработки.бестЗагрузитьДанныеИзВнешнихИсточников.ЗагрузитьДанныеГП(Дата, Организация, Услуга, Поставщик, ПутьКФайлу, ТЗПредоставленныеОбъемы.Выгрузить());
КонецПроцедуры

#КонецОбласти

#КонецОбласти
